# Создаем список сожержащий цифры
list_namber: list = [12, 20, 68, 44, 74, 58]

# Создаем счетчик для нашего цикла. Счётчик равен "0". Сюда будем записывать сумму остатков чесил списка
remainder: int = 0
# Создаем цикл, в котором мы будем проверять все чила списка но то, являються ли все числа  четными или есть хоть
# какое-то число нечетное.
while 0 < len(list_namber) and remainder == 0:
    # Каждое число списка проверяем на остаток делением на два, и добовляем наш остаток в счетчик. Если остаток от деле-
    # ния равен 0 то значит число является четным
    remainder += list_namber.pop() % 2
    # Когда после последнего проверенного числа в списке наш "counter" равен 0 то мы выводим 'All numbers are even'
    if len(list_namber) == 0 and remainder == 0:
        print('All numbers are even')
        break
# Если хоть один елемент в списке нечетный мы выводим на экран "No"
else:
    print('No')
