# Запрашиваем у пользователя ввод слов и помещаем его в список
world: str = input("Ведите текст чрез ',': ")

# Считаем длину введеной строки и добовляем к ней +1 символ
x = len(world) + 1

#  К нашему тексту добовляем пробел с левой стороны и разбиваем строку на список по ",". Затем берем список в моножество
#  для вывода уникального элемента. Затем сортируем наше множество по алфавиту и получаем список.
world: list = sorted(set(world.rjust(x, ' ').split(',')))

# Сшиваем наш список с помощю "," в строку и удаляем пробелы в начале и конце строки
world = ', '.join(world).strip()

print(world)
