# написать функцию, которая принимает в качестве аргументов два списка, а возвращает список, состоящий из элементов
# этих двух списков, при чем первый элемент списка - первый элемент первого аргумента, второй элемент списка - первый
# элемент второго списка, третий элемент - второй элемент первого списка, четвертый - второй элемент второго аргумента и
# т.д.

def merge_list(list_1, list_2):
    #  Влаживаем наши списки из аргументов в новый список
    new_list = [list_1] + [list_2]
    #  Соединяем елементы вложеных списиков так что первый элемент списка - первый элемент первого аргумента, второй
    #  элемент списка - первый элемент второго списка и т.д
    merge = [row[i] for i in range(len(new_list[0])) for row in new_list]
    return merge

print(merge_list([1, 2, 3, 5], [11, 22, 33, 85]))
